#include <stdio.h>
int data[2] = {100, 200};
int moredata[2] = {300, 400};
int main(void)
{
    int *p1, *p2, *p3;

    p1 = p2 = data;
    p3 = moredata;
    // 初始化
    printf("  *p1 = %d,   *p2 = %d,     *p3 = %d\n", *p1, *p2, *p3);
    // 由于* 和++ 优先级相同，从右到左结合，++先执行
    // *p1++ p1++的话也是指针先后移动一位，即p1[1]=200，属于后加 100
    // *++p2 ++p2的话就是指针先后移动一位，即p2[1]=200，属于立马加 200
    // (*p3)++) *p3是代表p3[0]=300，++的话就是301，属于后加 300
    printf("*p1++ = %d, *++p2 = %d, (*p3)++ = %d\n", *p1++, *++p2, (*p3)++);
    // *p1后加 200
    // *p2立马加 200
    // *p3后加 301
    printf("  *p1 = %d,   *p2 = %d,     *p3 = %d\n", *p1, *p2, *p3);

    return 0;
}
